OpenFOAM-4.x-master/tutorials/multiphase/interFoam/ras/waterChannel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

./Allmesh

cp 0/alpha.water.orig 0/alpha.water
runApplication setFields

runApplication $application

#------------------------------------------------------------------------------
